sklep/app/controllers/carts_controller.rb

  def edit
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 12 Jan 2013 17:19:25 UTC +00:00], ["updated_at", Sat, 12 Jan 2013 17:19:25 UTC +00:00]]

  def update
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "6"]]

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 6]]