sklep/app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @line_item = LineItem.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 12 Jan 2013 17:11:46 UTC +00:00], ["updated_at", Sat, 12 Jan 2013 17:11:46 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 26], ["created_at", Sun, 13 Jan 2013 12:01:07 UTC +00:00], ["order_id", nil], ["product_id", 1], ["quantity", 1], ["updated_at", Sun, 13 Jan 2013 12:01:07 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-01-12 18:03:13.850786' WHERE "line_items"."id" = 8
---
  def create
    @cart=current_cart
    product=Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    #@line_item.product=product
    #@line_item = LineItem.new(params[:line_item])

    respond_to do |format|
      if @line_item.save