sklep/app/controllers/orders_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 28
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 28
---
  def new
    @cart =current_cart
	if @cart.line_items.empty?

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 13 Jan 2013 12:50:46 UTC +00:00], ["updated_at", Sun, 13 Jan 2013 12:50:46 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 30]]
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)
    respond_to do |format|
      if @order.save
	Cart.destroy(session[:cart_id])